#+TITLE: Notes
#+AUTHOR: chodkows

* TABLE OF CONTENT :toc:
- [[#install-doom-emacs][Install Doom Emacs]]
  -  [[#git-223][Git 2.23+]]
  -  [[#emacs-271-272-is-recommended-or-native-comp][Emacs 27.1+ (27.2 is recommended, or native-comp).]]
  -  [[#ripgrep-110][ripgrep 11.0+]]
  -  [[#gnu-find][GNU find]]
  -  [[#optional-fd-730-improves-file-indexing-performance-for-some-commands][OPTIONAL: fd 7.3.0+ (improves file indexing performance for some commands)]]
- [[#test-go-in-org-mode][Test Go in org mode]]
- [[#test-sudo-with-bash][Test sudo with bash]]
- [[#test-sudo-with-bash-and-tramp][Test sudo with bash and tramp]]
- [[#how-to-prepare-bootable-pendrive-on-linuxoption-1][How to prepare bootable pendrive on linux(Option 1)]]
  - [[#check-pendrive-is-visible-in-system][Check pendrive is visible in system]]
  - [[#unmount-pendrive][Unmount pendrive]]
  - [[#write-iso-to-pendrivewill-block-emacs-for-time-of-writing][Write ISO to pendrive(will block emacs for time of writing)]]
- [[#how-to-prepare-bootable-pendrive-on-linuxoption-2][How to prepare bootable pendrive on linux(Option 2)]]
  - [[#check-block-devices][Check block devices]]
  - [[#unmount-pendrive-1][Unmount pendrive]]
  - [[#remove-data-from-pendrive][Remove data from pendrive]]
  - [[#write-iso-to-pendrive][Write ISO to pendrive]]
- [[#linux-namespace-networking][Linux namespace networking]]

* Install Doom Emacs
**  Git 2.23+
#+begin_src bash
sudo pacman -S git
#+end_src
**  Emacs 27.1+ (27.2 is recommended, or native-comp).
#+begin_src bash
sudo pacman -S emacs
#+end_src
**  ripgrep 11.0+
#+begin_src bash
sudo pacman -S rg
#+end_src
**  GNU find
Should be already installed.
**  OPTIONAL: fd 7.3.0+ (improves file indexing performance for some commands)
#+begin_src bash
sudo pacman -S fd
#+end_src

* Test Go in org mode
Need to install by: M-x -> package install -> ob-go
And restart doom by: M-x -> doom/reload
#+begin_src go :imports "fmt"
fmt.Println("Hello World!")
#+end_src

#+RESULTS:
: Hello World!

* Test sudo with bash
#+begin_src bash :var pw=(read-passwd "Password: ")
echo $pw | sudo -S echo "hello"
#+end_src

#+RESULTS:
: hello

* Test sudo with bash and tramp
#+begin_src bash :dir /sudo::
sudo echo "hello"
#+end_src

#+RESULTS:
: hello

* How to prepare bootable pendrive on linux(Option 1)
** Check pendrive is visible in system
#+begin_src bash
df -h
#+end_src

#+RESULTS:
| Filesystem                | Size | Used | Avail | Use% | Mounted                   | on |
| tmpfs                     | 763M | 2,0M | 761M  |   1% | /run                      |    |
| /dev/mapper/vgubuntu-root | 467G | 149G | 294G  |  34% | /                         |    |
| tmpfs                     | 3,8G | 0    | 3,8G  |   0% | /dev/shm                  |    |
| tmpfs                     | 5,0M | 4,0K | 5,0M  |   1% | /run/lock                 |    |
| /dev/nvme0n1p2            | 704M | 171M | 482M  |  27% | /boot                     |    |
| /dev/nvme0n1p1            | 511M | 73M  | 439M  |  15% | /boot/efi                 |    |
| tmpfs                     | 763M | 124K | 763M  |   1% | /run/user/1000            |    |
| /dev/sda1                 | 760M | 760M | 0     | 100% | /media/wojtek/ARCH_202111 |    |

** Unmount pendrive
#+begin_src bash :dir /sudo::
sudo umount /dev/sda1
#+end_src

#+RESULTS:

** Write ISO to pendrive(will block emacs for time of writing)
#+begin_src bash :dir /sudo::
sudo dd bs=4M if=/home/wojtek/ISO/arcolinuxb-leftwm-v22.01.10-x86_64.iso of=/dev/sda status=progress oflag=sync
#+end_src

#+RESULTS:

* How to prepare bootable pendrive on linux(Option 2)
** Check block devices
#+begin_src bash
lsblk
#+end_src

#+RESULTS:
| NAME              | MAJ:MIN | RM | SIZE   | RO | TYPE  | MOUNTPOINT                   |
| loop0             |     7:0 |  0 | 99,3M  |  1 | loop  | /snap/core/11743             |
| loop1             |     7:1 |  0 | 4K     |  1 | loop  | /snap/bare/5                 |
| loop2             |     7:2 |  0 | 61,9M  |  1 | loop  | /snap/core20/1270            |
| loop3             |     7:3 |  0 | 61,8M  |  1 | loop  | /snap/core20/1242            |
| loop4             |     7:4 |  0 | 99,4M  |  1 | loop  | /snap/core/11993             |
| loop5             |     7:5 |  0 | 168,6M |  1 | loop  | /snap/emacs/1300             |
| loop6             |     7:6 |  0 | 55,5M  |  1 | loop  | /snap/core18/2253            |
| loop7             |     7:7 |  0 | 242,3M |  1 | loop  | /snap/gnome-3-38-2004/76     |
| loop8             |     7:8 |  0 | 168,6M |  1 | loop  | /snap/emacs/1343             |
| loop9             |     7:9 |  0 | 247,9M |  1 | loop  | /snap/gnome-3-38-2004/87     |
| loop10            |    7:10 |  0 | 65,2M  |  1 | loop  | /snap/gtk-common-themes/1519 |
| loop11            |    7:11 |  0 | 54,2M  |  1 | loop  | /snap/snap-store/558         |
| loop12            |    7:12 |  0 | 154,6M |  1 | loop  | /snap/firefox/886            |
| loop13            |    7:13 |  0 | 9,1M   |  1 | loop  | /snap/k9s/151                |
| loop14            |    7:14 |  0 | 219M   |  1 | loop  | /snap/gnome-3-34-1804/77     |
| loop15            |    7:15 |  0 | 55,5M  |  1 | loop  | /snap/core18/2284            |
| loop16            |    7:16 |  0 | 51M    |  1 | loop  | /snap/snap-store/547         |
| loop17            |    7:17 |  0 | 219M   |  1 | loop  | /snap/gnome-3-34-1804/72     |
| loop18            |    7:18 |  0 | 153M   |  1 | loop  | /snap/firefox/777            |
| sda               |     8:0 |  1 | 7,2G   |  0 | disk  |                              |
| ├─sda1            |     8:1 |  1 | 760M   |  0 | part  | /media/wojtek/ARCH_202111    |
| └─sda2            |     8:2 |  1 | 86M    |  0 | part  |                              |
| nvme0n1           |   259:0 |  0 | 476,9G |  0 | disk  |                              |
| ├─nvme0n1p1       |   259:2 |  0 | 512M   |  0 | part  | /boot/efi                    |
| ├─nvme0n1p2       |   259:3 |  0 | 732M   |  0 | part  | /boot                        |
| └─nvme0n1p3       |   259:4 |  0 | 475,7G |  0 | part  |                              |
| └─nvme0n1p3_crypt |   253:0 |  0 | 475,7G |  0 | crypt |                              |
| ├─vgubuntu-root   |   253:1 |  0 | 474,8G |  0 | lvm   | /                            |
| └─vgubuntu-swap_1 |   253:2 |  0 | 980M   |  0 | lvm   | [SWAP]                       |
| nvme1n1           |   259:1 |  0 | 232,9G |  0 | disk  |                              |
| ├─nvme1n1p1       |   259:5 |  0 | 512M   |  0 | part  |                              |
| └─nvme1n1p2       |   259:6 |  0 | 232,4G |  0 | part  |                              |

** Unmount pendrive
#+begin_src bash
umount /dev/sda1
#+end_src

** Remove data from pendrive
#+begin_src bash
wipels --all /dev/sda
#+end_src

** Write ISO to pendrive
#+begin_src bash
cat /path/to/iso > /dev/sda
#+end_src

* Linux namespace networking
Network namespaces are use by containers to separete networking.
Process on container will have pid 1, but the same process in host
will have another pid.
#+begin_src bash
ps aux | grep nginx
#+end_src

#+RESULTS:
: chodkows    4219  0.0  0.0   9028  2384 ?        S    06:27   0:00 grep nginx

Host has own interface to communicate to LAN - eth0.
Host also has own arp and route table to store network information.
When container is created, there is created namespece.
Then container also have own arp and route table.
To create network ns:
#+begin_src bash :dir /sudo::
sudo ip netns add red
sudo ip netns add blue
#+end_src

#+RESULTS:
Check ip netns
#+begin_src bash
ip netns
#+end_src

#+RESULTS:
| blue |
| red  |

To list interfaces in host:
#+begin_src bash
ip link
#+end_src

#+RESULTS:
|            1: | lo:               | <LOOPBACK,UP,LOWER_UP>              | mtu               | 65536 | qdisc | noqueue  | state | UNKNOWN | mode | DEFAULT | group | default | qlen | 1000 |
| link/loopback | 00:00:00:00:00:00 | brd                                 | 00:00:00:00:00:00 |       |       |          |       |         |      |         |       |         |      |      |
|            2: | enp0s31f6:        | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |  1500 | qdisc | fq_codel | state | DOWN    | mode | DEFAULT | group | default | qlen | 1000 |
|    link/ether | 70:85:c2:62:20:01 | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |
|            3: | wlp0s20f0u10:     | <BROADCAST,MULTICAST,UP,LOWER_UP>   | mtu               |  1500 | qdisc | mq       | state | UP      | mode | DORMANT | group | default | qlen | 1000 |
|    link/ether | 74:da:38:c8:05:21 | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |

To list interfaces in namespace:
#+begin_src bash :dir /sudo::
sudo ip netns exec red ip link
#+end_src

#+RESULTS:
|            1: |               lo: | <LOOPBACK> |               mtu | 65536 | qdisc | noop | state | DOWN | mode | DEFAULT | group | default | qlen | 1000 |
| link/loopback | 00:00:00:00:00:00 | brd        | 00:00:00:00:00:00 |       |       |      |       |      |      |         |       |         |      |      |

Or simpler:
#+begin_src bash :dir /sudo::
sudo ip -n red link

#+end_src

#+RESULTS:
|            1: |               lo: | <LOOPBACK> |               mtu | 65536 | qdisc | noop | state | DOWN | mode | DEFAULT | group | default | qlen | 1000 |
| link/loopback | 00:00:00:00:00:00 | brd        | 00:00:00:00:00:00 |       |       |      |       |      |      |         |       |         |      |      |

In namespaces there is visible only loopback interface. There is no other interface from host.
The same is for arp and route table.
Arp table for host:
#+begin_src bash
arp
#+end_src

#+RESULTS:
| Address  | HWtype | HWaddress         | Flags | Mask         | Iface |
| _gateway | ether  | 00:12:2a:b6:a1:a1 | C     | wlp0s20f0u10 |       |

Arp for namespece
#+begin_src bash :dir /sudo::
sudo ip netns exec red arp
#+end_src

#+RESULTS:

Route for host:
#+begin_src bash
route
#+end_src

#+RESULTS:
| Kernel      | IP       |       routing | table |        |     |     |              |
| Destination | Gateway  |       Genmask | Flags | Metric | Ref | Use | Iface        |
| default     | _gateway |       0.0.0.0 | UG    |    600 |   0 |   0 | wlp0s20f0u10 |
| 192.168.1.0 | 0.0.0.0  | 255.255.255.0 | U     |    600 |   0 |   0 | wlp0s20f0u10 |

Route for namespece:
#+begin_src bash :dir /sudo::
sudo ip netns exec red route
#+end_src

#+RESULTS:
| Kernel      | IP      | routing | table |        |     |     |       |
| Destination | Gateway | Genmask | Flags | Metric | Ref | Use | Iface |

To connect to namespaces there is neccecery to create pipe or "virtual cabel" between them:
#+begin_src bash :dir /sudo::
ip link add veth-red type veth peer name veth-blue
#+end_src

#+RESULTS:

Check links:
#+begin_src bash
ip link
#+end_src

#+RESULTS:
|            1: | lo:                 | <LOOPBACK,UP,LOWER_UP>              | mtu               | 65536 | qdisc | noqueue  | state | UNKNOWN | mode | DEFAULT | group | default | qlen | 1000 |
| link/loopback | 00:00:00:00:00:00   | brd                                 | 00:00:00:00:00:00 |       |       |          |       |         |      |         |       |         |      |      |
|            2: | enp0s31f6:          | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu               |  1500 | qdisc | fq_codel | state | DOWN    | mode | DEFAULT | group | default | qlen | 1000 |
|    link/ether | 70:85:c2:62:20:01   | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |
|            3: | wlp0s20f0u10:       | <BROADCAST,MULTICAST,UP,LOWER_UP>   | mtu               |  1500 | qdisc | mq       | state | UP      | mode | DORMANT | group | default | qlen | 1000 |
|    link/ether | 74:da:38:c8:05:21   | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |
|            9: | veth-blue@veth-red: | <BROADCAST,MULTICAST,M-DOWN>        | mtu               |  1500 | qdisc | noop     | state | DOWN    | mode | DEFAULT | group | default | qlen | 1000 |
|    link/ether | 26:7b:c5:f8:fe:bd   | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |
|           10: | veth-red@veth-blue: | <BROADCAST,MULTICAST,M-DOWN>        | mtu               |  1500 | qdisc | noop     | state | DOWN    | mode | DEFAULT | group | default | qlen | 1000 |
|    link/ether | 7e:92:71:8f:61:fd   | brd                                 | ff:ff:ff:ff:ff:ff |       |       |          |       |         |      |         |       |         |      |      |

Attach red cabel to red namespace:
#+begin_src bash :dir /sudo::
ip link set veth-red netns red
#+end_src

#+RESULTS:

Attach blue cabel to blue namespace:
#+begin_src bash :dir /sudo::
ip link set veth-blue netns blue
#+end_src

#+RESULTS:

Add address ip for both cabels:
#+begin_src bash :dir /sudo::
ip -n red addr add 192.168.15.1 dev veth-red
ip -n blue addr add 192.168.15.2 dev veth-blue
#+end_src

#+RESULTS:

Switch on both devices:
#+begin_src bash :dir /sudo::
ip -n red link set veth-red up
ip -n blue link set veth-blue up
#+end_src

#+RESULTS:

Check connection between namespaces
#+begin_src bash :dir /sudo::
ip netns exec red ping -c 4 192.168.15.2
#+end_src

#+RESULTS:
